{"data":{"site":{"siteMetadata":{"title":"Expecto Frontendum"}},"markdownRemark":{"id":"4c6e218e-927c-5951-b6f5-2aec57cdd8c4","html":"<p>We are in the middle of the SARS-CoV-2 pandemic and a lot of people start working from home. Me included. Usually I commute to work and code in the office. I get to work remotely once in a blue moon: when I feel under the weather or wait for a delivery of a large package. Right now I have the option to socially distance myself and WFH. To be honest, I am finding this situation a little difficult.</p>\n<p>I was lucky to be scrolling through Twitter at the time to catch the <a href=\"https://twitter.com/dhh/status/1239959732904812544?s=20\">live Q&#x26;A on remote work</a> with Jason Fried and David Heinemeier Hansson from Basecamp. The stream took about two hours and there were so many things to get out of it I started taking notes.</p>\n<h3>Relax expectations</h3>\n<p>Transitioning a company (or even just its part) to go full remote in a matter of days is a daunting task. Employees need time to adjust. They need time to organize their space. They share their time with family e.g. due to closed schools. They are stressed and worried about the current health situation. Productivity will not be 100%. And it’s okay.</p>\n<h3>Deadlines are made up</h3>\n<p>Literally. Thinking about it this way is surprisingly freeing. Someone just set them. They can be moved and in this situation that we are all in, they probably <em>will</em> be moved. </p>\n<h3>Asynchronous work</h3>\n<p>I usually use e-mail for asynchronous communication and slack for the synchronous one. Right now I should treat all written communication as asynchronous and <em>don’t expect an immediate response</em>. This one is hard for me as I am used to instant replies on chat. I should not assume though, that my task is more important than whatever someoen else works on.</p>\n<h3>Manage isolation</h3>\n<p>What I like about working in the office is the feeling of camaraderie: meeting other people, interacting with them, joking around. Working from home alone would not be so hard if I could just pop out to a pub to grab a beer with friends. But this is not what social distancing is about.</p>\n<h4>Tips from Basecamp:</h4>\n<ul>\n<li>Break up your work day, break up the feeling of working alone, e.g. by watching tv, taking a walk, cooking lunch.</li>\n<li>Tell your teammates about your loneliness, share it with them.</li>\n</ul>\n<h4>My addidtions</h4>\n<ul>\n<li>\n<p>Add some background sounds to your work space, a little white noise, e.g. <a href=\"https://coffitivity.com/\">Coffitivity</a>, which</p>\n<blockquote>\n<p>recreates the ambient sounds of a cafe to boost your creativity and help you work better.</p>\n</blockquote>\n</li>\n<li>Organise a videocall and grab a coffee witha friend (this is a lifesaver for me!)</li>\n</ul>\n<h3>Other cool stuff from Basecamp</h3>\n<ul>\n<li>5 by 12 - (did I get it right?) once a month get 5 random people to talk about non work related stuff for an hour. (Also, it is transcribed),</li>\n<li>Using <a href=\"https://tuple.app/\">Tuple</a> for remote pair programming,</li>\n<li>The concept of <em>no shared calendars</em>. Organising your own time by not letting others govern it. </li>\n</ul>","frontmatter":{"title":"Remote work tips from Basecamp","date":"March 17, 2020","summary":"Notes and impressions on remote work by Basecamp","author":{"id":"kasia-zadurska","name":"Kasia Zadurska","bio":"Front-end dev, ReactJS enthusiast code review lover","avatar":{"publicURL":"/static/kasia-profile-pic-89e744b34d9d14a467c4e31fdc49ec17.jpg"},"links":{"twitter":"https://twitter.com/kzadurska","github":"https://github.com/kzadurska"}}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/remote-tips-from-basecamp/","previous":{"fields":{"slug":"/my-vs-code-setup/"},"frontmatter":{"title":"My VS Code setup"}},"next":null}}